1. 省减灾委成立救灾应急指挥部，统一组织开展抗灾救灾工作。<br/><br/>
2. 省民政厅全体工作人员参与灾情救助工作，实行24小时值班。<br/><br/>
3. 省民政厅在接到灾害发生信息后，1小时内向省政府和民政部报告，之后及时续报有关情况。省减灾委办公室要与灾区保持24小时专线联系，随时掌握灾情动态信息，及时编发《民政灾情信息》、《重要灾情快报》报送省政府和民政部，并向省减灾委成员单位通报情况。从灾害发生开始，有关地级以上市民政局每日10时前要向省民政厅上报相关灾情和救灾工作动态信息。<br/><br/>
4. 灾情发生24小时内，省民政厅派出工作组赶赴灾区核查灾情，慰问灾民，了解灾区救灾情况及需求，指导地方开展救灾工作；商省财政厅下拨救灾应急资金，并联合向民政部、财政部申请救灾应急资金；向灾区紧急调拨救灾物资；及时落实民政部和省委、省政府关于抗灾救灾的指示。<br/><br/>
灾情发生后24小时内，省民政厅向省委、省政府建议：<br/><br/>
　　（1）以省委、省政府名义向灾区发慰问电；<br/><br/>
　　（2）省委、省政府派出省领导带队的工作组或慰问团赴灾区；<br/><br/>
　　（3）省政府组织召开抗灾救灾综合协调会，对灾区抗灾救灾的重大事项作出部署。<br/><br/>
5. 省民政厅及时向社会发布接受救灾捐赠的公告，公布灾情、灾区需求、接受捐赠的单位和账号，设立救灾捐赠热线电话，按规定组织开展救灾捐赠活动；定期对救灾捐赠的接收和使用情况向社会进行公告。<br/><br/>
6. 灾情发生后，省民政厅及时组织有关专家赴灾区进行现场灾情和需求评估，形成评估报告，报民政部、省政府；灾情稳定后，及时组织召开灾情评估会，向有关部门通报评估结果。<br/><br/>